{
    "Биология": {
        "Экология": [
            "Влияние изменения климата на миграцию птиц.",
            "Роль микробов в разложении органических веществ.",
            "Изучение биоразнообразия в городских экосистемах.",
            "Влияние инвазивных видов на местные экосистемы.",
            "Экологические последствия использования пластика в океанах.",
            "Влияние сельского хозяйства на экосистемы.",
            "Сохранение редких видов: методы и стратегии.",
            "Экологические аспекты урбанизации и её влияние на флору и фауну.",
            "Роль заповедников в охране биоразнообразия.",
            "Изучение влияния загрязнения воздуха на здоровье растений."
        ],
        "Генетика": [
            "Генетические модификации: плюсы и минусы.",
            "Изучение наследственных заболеваний у человека.",
            "Генетика и её влияние на поведение животных.",
            "Клонирование: этические и научные аспекты.",
            "Роль CRISPR в редактировании генома.",
            "Генетика и агрономия: как гены влияют на урожайность.",
            "Изучение генетических маркеров для диагностики болезней.",
            "Эволюция генетических технологий в медицине.",
            "Генетические исследования в области антропологии.",
            "Влияние окружающей среды на экспрессию генов."
        ],
        "Анатомия и физиология": [
            "Сравнительная анатомия: как строение тела животных влияет на их поведение.",
            "Физиология стресса: как стресс влияет на организм человека.",
            "Изучение работы сердечно-сосудистой системы у спортсменов.",
            "Анатомия мозга: как различные области мозга отвечают за разные функции.",
            "Влияние питания на здоровье человека: физиологические аспекты.",
            "Физиология сна: как сон влияет на здоровье.",
            "Анатомия дыхательной системы: как она адаптируется к физическим нагрузкам.",
            "Изучение работы иммунной системы в условиях стресса.",
            "Анатомия и физиология репродуктивной системы человека.",
            "Влияние физических упражнений на метаболизм."
        ],
        "Эволюция": [
            "Эволюция человека: от древних предков до современности.",
            "Микроэволюция: как виды адаптируются к изменениям среды.",
            "Роль естественного отбора в эволюции видов.",
            "Эволюция социальных структур у животных.",
            "Изучение ископаемых: как они помогают понять эволюцию жизни на Земле.",
            "Эволюция растений: от водорослей до цветковых.",
            "Влияние человека на эволюцию других видов.",
            "Сравнительная эволюция: как разные виды адаптировались к одной среде.",
            "Эволюция поведения: как социальные взаимодействия влияют на выживание.",
            "Изучение эволюционных изменений в ответ на климатические изменения."
        ]
    },
    "География": {
        "Физическая география": [
            "Изучение влияния изменения климата на ледники Антарктиды.",
            "Геологические процессы: как вулканы формируют ландшафт.",
            "Роль лесов в поддержании экосистемы и борьбе с глобальным потеплением.",
            "Влияние океанских течений на климатические условия в разных регионах мира.",
            "Исследование природных катастроф: причины и последствия землетрясений.",
            "Анализ влияния человеческой деятельности на природные ландшафты.",
            "Изучение биоразнообразия в тропических лесах.",
            "География водных ресурсов: проблемы и решения.",
            "Влияние загрязнения на экосистемы рек и озер.",
            "Роль климатических зон в формировании флоры и фауны."
        ],
        "Экономическая география": [
            "Глобализация и ее влияние на местные экономики.",
            "Роль туризма в экономическом развитии малых стран.",
            "Анализ распределения природных ресурсов и их влияние на экономику.",
            "Влияние технологий на сельское хозяйство: от традиционных методов к современным.",
            "Экономические последствия изменения климата для развивающихся стран.",
            "Изучение влияния международной торговли на экономическое развитие.",
            "Роль транспортной инфраструктуры в экономическом росте регионов.",
            "Анализ влияния экономических санкций на географию торговли.",
            "Влияние миграции рабочей силы на экономику стран.",
            "География инноваций: как регионы становятся центрами технологий."
        ],
        "Социальная география": [
            "Городская миграция: причины и последствия для мегаполисов.",
            "Влияние культурного разнообразия на социальные отношения в городах.",
            "Социальные движения и их влияние на географическое пространство.",
            "Роль образования в формировании социального капитала в сообществах.",
            "Изучение влияния социальных сетей на географическую мобильность.",
            "Анализ влияния бедности на доступ к ресурсам в городах.",
            "География здоровья: как место проживания влияет на здоровье населения.",
            "Роль искусства в формировании городской идентичности.",
            "Изучение влияния климатических изменений на социальные структуры.",
            "География преступности: факторы и тенденции."
        ],
        "География населения": [
            "Демографические изменения в результате миграции: анализ на примере Европы.",
            "Влияние старения населения на экономическое развитие стран.",
            "Географическое распределение населения: факторы и тенденции.",
            "Анализ урбанизации: как города влияют на жизнь людей.",
            "Изучение влияния пандемий на демографические процессы.",
            "Роль миграции в формировании этнических сообществ.",
            "Анализ распределения населения по возрастным группам в разных странах.",
            "Влияние природных катастроф на миграционные процессы.",
            "География безработицы: причины и последствия.",
            "Изучение влияния образования на миграционные потоки."
        ]
    },
    "Информатика": {
        "Программирование": [
            "Разработка калькулятора с графическим интерфесом",
            "Разработка мода для игры Minecraft",
            "Разработка парсера для получения данных с какого-либо сайта",
            "Разработка телеграм-бота для контроля успеваемости.",
            "Изучение основ HTML, CSS и JS. Создание простого веб-сайта о своём хобби.",
            "Изучение основ программирования на языке Python и создание простых телеграм-ботов.",
            "Исследование и создание простых алгоритмов для автоматизации повседневных задач.",
            "Изучение основ разработки мобильных приложений и создание простого трекера задач (TODO-листа).",
            "Разработка бота-тренажера для быстрого запоминания таблицы умножения.",
            "Компьютерное зрение: \"Обучение нейронной модели распознованию цифр\".",
            "Компьютерное зрение: \"Как нейросети помогают фермерам?\".",
            "Информационная безопасность: \"Написание простого компьютерного вируса\".",
            "Создание голосового ассистента на python.",
            "Создание системы для проведения экзаменов/олипиад.",
            "Разработка веб-приложения для учета финансов с использованием Python и Flet.",
            "Разработка игры на Unity и C#.",
            "Создание блога о программировании с использованием Markdown и Jekyll.",
            "Как устроено сквозное шифрование?",
            "Создание приложения для быстрой навигации по домашней библиотеке.",
            "Создание веб-приложения для удобного занесения своей родословной."
        ],
        "Разработка игр": [
            "Создание текстовой RPG-игры на Python (в т.ч. ascii-арта).",
            "Разработка кликера на HTML, CSS и JS (или React).",
            "Разработка игры \"Угадай число\" на python и pygames.",
            "Разработка игры \"Крестики-нолики\" на python и pygames.",
            "Разработка игры \"UNO\" на python и pygames.",
            "Разработка игры \"Виселица\" на python и pygames.",
            "Разработка игры \"Найди пару\" на python и pygames.",
            "Разработка игры \"Тетрис\" на python и pygames.",
            "Разработка игры \"Морской бой\" на python и pygames.",
            "Разработка игры \"Угадай мелодию\" на python и pygames.",
            "Разработка игры \"Шашки\" на python и pygames.",
            "Разработка игры \"Шахматы\" на python и pygames.",
            "Разработка игры \"GO\" на python и pygames.",
            "Разработка игры \"Пятнашки\" на python и pygames."
        ],
        "Робототехника": [
            "Автоматизация сборки школьного ранца.",
            "Создание дронов для мониторинга сельскохозяйственных угодий.",
            "Разработка робота для сортировки мусора на основе компьютерного зрения.",
            "Создание робота-уборщика для дома с использованием Arduino."
        ],
        "Другое": [
            "Разработка игры с использованием Scratch.",
            "Заметки и их влияние на IT-сферу (obsidian, notion, TODO-листы).",
            "Моделирование и анимация в 3D (blender, и другие подобные программы).",
            "Что выбрать: Linux или Windows.",
            "Исследование и анализ влияния искусственного интеллекта на рынок труда.",
            "Исследование и объяснение понятия виртуальной реальности и ее применения в различных сферах жизни."
        ]
    },
    "Математика": {
        "Алгебра": [
            "Алгебраические уравнения: решение и графическое представление.",
            "Моделирование реальных процессов с помощью систем линейных уравнений.",
            "Алгебраические функции: исследование их свойств и графиков.",
            "Применение матриц в решении задач из экономики.",
            "Алгебра: создание игры для обучения решению квадратных уравнений.",
            "Исследование и применение неравенств в реальной жизни.",
            "Алгебраические структуры: группы, кольца и поля в криптографии.",
            "Создание интерактивного приложения для изучения алгебраических формул.",
            "Алгебра: анализ и решение задач на оптимизацию."
        ],
        "Геометрия": [
            "Геометрические фигуры: создание 3D-моделей с использованием CAD-программ.",
            "Исследование фракталов: создание фрактальных изображений.",
            "Геометрия в архитектуре: анализ известных зданий и их форм.",
            "Геометрия: создание игры на основе геометрических фигур.",
            "Применение геометрии в компьютерной графике.",
            "Геометрические преобразования: исследование симметрии в природе.",
            "Геометрия: создание интерактивного приложения для изучения теорем.",
            "Исследование и применение теоремы Пифагора в реальных задачах.",
            "Геометрия: создание модели для изучения многогранников."
        ],
        "Тригонометрия": [
            "Тригонометрические функции: исследование их свойств и графиков.",
            "Применение тригонометрии в навигации и GPS-технологиях.",
            "Создание модели для изучения колебательных процессов с использованием тригонометрии.",
            "Тригонометрия: анализ и решение задач на нахождение углов и расстояний.",
            "Исследование тригонометрических уравнений и их применение в физике.",
            "Создание интерактивного приложения для изучения тригонометрических функций.",
            "Тригонометрия в музыке: анализ звуковых волн и частот.",
            "Применение тригонометрии в астрономии: расчет расстояний до звезд."
        ],
        "Статистика и вероятность": [
            "Анализ данных: создание проекта по сбору и обработке статистической информации.",
            "Вероятностные модели: исследование случайных процессов в природе.",
            "Создание игры на основе теории вероятностей.",
            "Статистика: анализ и визуализация данных с использованием Python.",
            "Применение статистики в медицине: анализ эффективности лечения.",
            "Исследование влияния случайности на результаты спортивных соревнований.",
            "Создание интерактивного приложения для изучения основ статистики.",
            "Вероятность: анализ и моделирование финансовых рисков.",
            "Статистика: исследование зависимости между переменными в реальных данных.",
            "Создание проекта по анализу социальных сетей с использованием статистических методов.",
            "Применение теории вероятностей в страховании: расчет рисков.",
            "Статистика: исследование и анализ выборок в социологических опросах.",
            "Создание модели для прогнозирования погоды на основе статистических данных.",
            "Вероятностные игры: анализ шансов и стратегий выигрыша."
        ]
    },
    "Обществознание": {
        "Общество": [
            "Влияние социальных сетей на формирование общественного мнения.",
            "Влияние современной музыки на общество.",
            "Социальные движения: история и современность.",
            "Роль образования в социальном развитии общества.",
            "Проблемы миграции: причины и последствия для стран.",
            "Влияние культуры на социальные нормы и ценности.",
            "Социальная справедливость: что это значит в современном мире.",
            "Анализ гендерных стереотипов в обществе.",
            "Влияние массовой культуры на молодежь.",
            "Социальная мобильность: факторы и тенденции.",
            "Проблемы неравенства в современном обществе."
        ],
        "Экономика": [
            "Глобализация и ее влияние на экономическое развитие стран.",
            "Экономические последствия пандемии COVID-19.",
            "Роль малого и среднего бизнеса в экономике страны.",
            "Анализ влияния технологий на рынок труда.",
            "Экономика устойчивого развития: принципы и практики.",
            "Влияние международной торговли на экономику развивающихся стран.",
            "Финансовая грамотность: важность и методы обучения.",
            "Экономические кризисы: причины и последствия.",
            "Рынок труда: тенденции и прогнозы на будущее.",
            "Экономика и экология: как совместить развитие и защиту окружающей среды."
        ],
        "Политика": [
            "Влияние выборов на политическую систему страны.",
            "Роль СМИ в политическом процессе.",
            "Анализ политических идеологий: либерализм, консерватизм, социализм.",
            "Глобальные проблемы и международные организации.",
            "Политическая культура: как она формируется и изменяется.",
            "Влияние коррупции на политическую стабильность.",
            "Роль молодежи в политических движениях.",
            "Анализ внешней политики ведущих стран мира.",
            "Политические партии: функции и влияние на общество.",
            "Проблемы демократии в современном мире."
        ],
        "Право": [
            "История развития прав человека: от античности до современности.",
            "Анализ системы уголовного права в разных странах.",
            "Права женщин: достижения и проблемы в современном обществе.",
            "Влияние международного права на национальное законодательство.",
            "Проблемы правосудия: доступность и справедливость.",
            "Защита прав потребителей: законодательные инициативы.",
            "Анализ правовых норм в сфере экологии.",
            "Проблемы прав человека в условиях кризиса.",
            "Роль адвоката в системе правосудия.",
            "Право и мораль: соотношение понятий."
        ],
        "Этика": [
            "Этические дилеммы в медицине: права пациента и врачебная тайна.",
            "Влияние технологий на этические нормы в обществе.",
            "Экологическая этика: ответственность человека перед природой.",
            "Этика бизнеса: принципы и практики.",
            "Проблемы биоэтики: от клонирования до генетических исследований.",
            "Социальная ответственность: что это значит для бизнеса.",
            "Этика в журналистике: баланс между свободой слова и ответственностью.",
            "Анализ этических теорий: утилитаризм, деонтология и добродетельная этика.",
            "Этика и политика: как моральные нормы влияют на принятие решений.",
            "Проблемы этики в сфере искусственного интеллекта."
        ]
    },
    "Химия": {
        "Органическая химия": [
            "Исследование синтеза новых органических соединений для фармацевтической промышленности.",
            "Анализ влияния различных катализаторов на реакцию эстерфикации.",
            "Разработка методов получения биодизеля из растительных масел.",
            "Изучение свойств и применения полимеров на основе природных материалов.",
            "Синтез и исследование свойств новых красителей для текстильной промышленности.",
            "Исследование взаимодействия органических соединений с металлами в катализе.",
            "Разработка экологически чистых методов синтеза органических веществ.",
            "Анализ влияния температуры на скорость реакции нуклеофильного замещения.",
            "Синтез органических фотовольтаических материалов для солнечных батарей.",
            "Изучение механизмов реакций окисления органических соединений."
        ],
        "Неорганическая химия": [
            "Изучение свойств и применения наноматериалов в электронике.",
            "Синтез и исследование новых соединений переходных металлов.",
            "Анализ методов очистки сточных вод с использованием неорганических сорбентов.",
            "Исследование термодинамических свойств неорганических солей.",
            "Разработка новых катализаторов на основе редкоземельных металлов.",
            "Изучение влияния pH на растворимость неорганических соединений.",
            "Синтез и применение комплексных соединений в медицине.",
            "Анализ методов получения водорода из воды с использованием солнечной энергии.",
            "Исследование свойств и применения суперкондукторов.",
            "Разработка методов синтеза новых неорганических пигментов."
        ],
        "Физическая химия": [
            "Исследование кинетики реакций в газовой фазе.",
            "Анализ термодинамических свойств растворов электролитов.",
            "Изучение влияния давления на равновесие химических реакций.",
            "Разработка методов спектроскопии для анализа сложных смесей.",
            "Исследование процессов адсорбции на поверхности твердых тел.",
            "Анализ влияния температуры на свойства жидкостей.",
            "Изучение фотохимических реакций и их применения в солнечной энергетике.",
            "Разработка новых методов измерения вязкости жидкостей.",
            "Исследование термодинамики биохимических реакций.",
            "Анализ влияния магнитного поля на химические реакции."
        ],
        "Биохимия": [
            "Исследование роли белков в метаболизме клеток.",
            "Анализ взаимодействия ферментов с субстратами.",
            "Разработка методов диагностики заболеваний на основе биомаркеров.",
            "Изучение механизмов действия антибиотиков на микробные клетки.",
            "Анализ влияния диеты на микробиом человека.",
            "Исследование процессов гликолиза и их регуляции.",
            "Разработка методов генной терапии для лечения наследственных заболеваний.",
            "Изучение роли витаминов в обмене веществ.",
            "Анализ механизмов действия гормонов на клеточном уровне.",
            "Исследование влияния стресса на биохимические процессы в организме."
        ]
    },
    "История": {
        "Древняя история": [
            "Влияние древнегреческой демократии на современные политические системы.",
            "Роль религии в жизни древних египтян.",
            "Торговые пути древнего мира и их влияние на культурный обмен.",
            "Архитектурные достижения Древнего Рима: акведуки и амфитеатры.",
            "Древние цивилизации Месопотамии: вклад в науку и искусство."
        ],
        "Средневековая история": [
            "Крестовые походы: их влияние на Европу и Ближний Восток.",
            "Рыцарские ордена и их роль в средневековом обществе.",
            "Чума в Европе: социальные и экономические последствия.",
            "Готическая архитектура: символы и значение.",
            "Жизнь в средневековом монастыре: духовность и труд."
        ],
        "Новая история": [
            "Французская революция: причины и последствия для Европы.",
            "Индустриальная революция: как она изменила общество.",
            "Роль женщин в борьбе за права в 19 веке.",
            "Империализм: причины и последствия для колонизированных стран.",
            "Влияние Первой мировой войны на международные отношения."
        ],
        "История современности": [
            "Вторая мировая война: ключевые события и их влияние на мир.",
            "Холодная война: идеологические противоречия и их последствия.",
            "Деколонизация: как страны освобождались от колониального владычества.",
            "Глобализация: влияние на культуру и экономику стран.",
            "Технологические достижения 20 века и их влияние на общество."
        ],
        "Разное": [
            "История прав человека: от Magna Carta до современных стандартов.",
            "Влияние искусства на политические движения.",
            "Культура и общество в эпоху Ренессанса.",
            "Роль науки в развитии общества: от античности до современности.",
            "История миграций: как перемещения народов изменили мир.",
            "Экологические движения: история и современное состояние.",
            "Влияние войны на искусство и литературу.",
            "Социальные изменения в результате технологических революций.",
            "История образования: от древних школ до современных университетов.",
            "Роль спорта в формировании национальной идентичности."
        ]
    },
    "Литература": {
        "Поэзия": [
            "Влияние символизма на современную поэзию.",
            "Анализ поэзии Серебряного века: ключевые темы и образы.",
            "Роль природы в лирике Александра Блока.",
            "Поэзия войны: как литература отражает трагедию и героизм.",
            "Сравнительный анализ любовной лирики Пушкина и Есенина.",
            "Экспериментальная поэзия: как новые формы меняют восприятие текста.",
            "Поэзия и музыка: взаимодействие двух искусств.",
            "Тема одиночества в поэзии XX века.",
            "Поэтические образы в произведениях Марины Цветаевой.",
            "Влияние фольклора на современную поэзию."
        ],
        "Проза": [
            "Роль реализма в русской литературе XIX века.",
            "Анализ произведений Федора Достоевского: философские и моральные вопросы.",
            "Сравнительный анализ романов 'Война и мир' и 'Анна Каренина'.",
            "Тема времени в прозе Михаила Булгакова.",
            "Психологический роман: особенности и примеры.",
            "Влияние исторического контекста на творчество Льва Толстого.",
            "Фантастика в прозе: от Гоголя до современных авторов.",
            "Женские образы в русской прозе XX века.",
            "Тема поиска идентичности в произведениях современных писателей.",
            "Сказка как жанр: анализ произведений народного и авторского творчества."
        ],
        "Драматургия": [
            "Роль театра в обществе: от античности до современности.",
            "Анализ пьесы 'Три сестры' Антона Чехова: темы и конфликты.",
            "Драматургия абсурда: особенности и ключевые авторы.",
            "Сравнительный анализ трагедии и комедии в театре.",
            "Влияние исторических событий на развитие драматургии.",
            "Тема любви и предательства в пьесах Уильяма Шекспира.",
            "Современный театр: новые формы и подходы к драматургии.",
            "Роль режиссуры в интерпретации драматургического текста.",
            "Анализ пьесы 'Гроза' Александра Островского: социальные и моральные аспекты.",
            "Драматургия и психология: как внутренний мир персонажей влияет на сюжет."
        ],
        "Литературные направления": [
            "Романтизм: ключевые идеи и представители.",
            "Модернизм в литературе: особенности и влияние на творчество.",
            "Постмодернизм: как он меняет восприятие литературы.",
            "Сравнительный анализ реализма и романтизма в русской литературе.",
            "Влияние экзистенциализма на современную прозу.",
            "Литература и феминизм: как женские голоса меняют литературный ландшафт.",
            "Символизм: основные идеи и его влияние на поэзию.",
            "Литература и экология: как экологические проблемы отражаются в текстах.",
            "Классицизм: его влияние на развитие европейской литературы.",
            "Литературные направления XX века: от сюрреализма до магического реализма."
        ]
    },
    "Физика": {
        "Механика": [
            "Исследование влияния угла наклона на скорость скатывания шарика по наклонной плоскости.",
            "Создание модели маятника и анализ его колебаний при различных условиях.",
            "Изучение законов сохранения импульса на примере столкновения двух тел.",
            "Разработка устройства для измерения силы трения между различными материалами.",
            "Анализ движения планет в солнечной системе с использованием законов Кеплера.",
            "Исследование зависимости силы тяжести от высоты над уровнем моря.",
            "Создание модели катапульты и анализ её дальности стрельбы.",
            "Изучение колебаний пружины и влияние массы на период колебаний.",
            "Разработка устройства для измерения углового ускорения вращающегося тела.",
            "Анализ движения тела по окружности и влияние центростремительного ускорения."
        ],
        "Электричество и магнетизм": [
            "Создание простого электромагнита и исследование его силы в зависимости от числа витков провода.",
            "Изучение принципа работы солнечной батареи и её эффективность в различных условиях освещения.",
            "Разработка схемы простого генератора переменного тока и анализ его работы.",
            "Исследование влияния магнитного поля на движение заряженных частиц.",
            "Создание модели электрической цепи и анализ её поведения при различных нагрузках.",
            "Изучение законов Ома и Кирхгофа на примере реальных электрических цепей.",
            "Разработка устройства для измерения сопротивления различных материалов.",
            "Исследование явления электростатического притяжения и отталкивания.",
            "Создание модели трансформатора и анализ его работы.",
            "Изучение принципа работы электродвигателя и его применение в быту."
        ],
        "Оптика": [
            "Изучение преломления света в различных средах с помощью простых экспериментов.",
            "Создание модели камеры и анализ её работы с точки зрения оптики.",
            "Исследование явления интерференции света с использованием двух щелей.",
            "Разработка устройства для измерения угла отражения и преломления света.",
            "Анализ влияния различных фильтров на цветовое восприятие света.",
            "Изучение законов отражения и преломления на примере стеклянной призмы.",
            "Создание модели спектроскопа и анализ спектров различных источников света.",
            "Исследование оптических иллюзий и их физические основы.",
            "Разработка устройства для создания стереоскопического изображения.",
            "Изучение влияния температуры на скорость света в различных средах."
        ],
        "Термодинамика": [
            "Изучение процессов теплообмена между телами с различными температурами.",
            "Создание модели холодильника и анализ его работы с точки зрения термодинамики.",
            "Исследование зависимости давления газа от температуры и объема в замкнутом сосуде.",
            "Разработка устройства для измерения теплопроводности различных материалов.",
            "Анализ работы парового двигателя и его эффективность в различных условиях.",
            "Изучение законов термодинамики на примере реальных процессов.",
            "Создание модели теплового насоса и анализ его работы.",
            "Исследование влияния влажности на теплопроводность воздуха.",
            "Разработка устройства для измерения температуры с использованием термопары.",
            "Изучение процессов сгорания и их термодинамические характеристики."
        ]
    }
}